/**
 * Урок 1: Примитивные типы
 *
 * Инструкция:
 * 1. Просмотри ошибки в этом файле.
 * 2. Исправь их, следуя аннотациям типов.
 * 3. Если нужно, измени значения переменных так, чтобы они соответствовали типам.
 */

// 1. Исправь значение, чтобы оно соответствовало типу 'string'
let mentorName: string = 123;

// 2. Исправь значение, чтобы оно соответствовало типу 'number'
let lessonsCount: number = "one";

// 3. Исправь значение, чтобы оно соответствовало типу 'boolean'
let isLearningFun: boolean = "yes";

// 4. Задача: типизируй переменные ниже (добавь аннотации типов)
let userName = "Alex";
let userAge = 25;
let hasAccess = true;

// 5. Попробуй изменить переменную userName так, чтобы TS выдал ошибку.
// (Закомментируй ошибочную строку после того как увидишь ошибку)


console.log({
    mentorName,
    lessonsCount,
    isLearningFun,
    userName,
    userAge,
    hasAccess
});
